In [1]:
import pandas as pd

In [2]:
nba = pd.read_csv('../data/NBA_Player_of_the_Week.csv', parse_dates = ['Date'])

In [3]:
nba.head()

,Active season,Player,Team,Conference,Date,Position,Height,Weight,Age,Draft Year,Seasons in league,Season,Season short,Real_value
0,0,Micheal Ray Richardson,New Jersey Nets,NaN,1985-04-14,PG,6-5,189,29,1978,6,1984-1985,1985,1.0
1,0,Derek Smith,Los Angeles Clippers,NaN,1985-04-07,SG,6-6,205,23,1982,2,1984-1985,1985,1.0
2,0,Calvin Natt,Denver Nuggets,NaN,1985-04-01,F,6-6,220,28,1979,5,1984-1985,1985,1.0
3,0,Kareem Abdul-Jabbar,Los Angeles Lakers,NaN,1985-03-24,C,7-2,225,37,1969,15,1984-1985,1985,1.0
4,0,Larry Bird,Boston Celtics,NaN,1985-03-17,SF,6-9,220,28,1978,5,1984-1985,1985,1.0

In [4]:
nba['Player'].nunique()

282

In [5]:
nba.groupby('Team').agg({'Season':'max' , 'Date':'count'}).sort_values('Date', ascending = False).head()

                        Season  Date
Team
Los Angeles Lakers   2012-2013    71
San Antonio Spurs    2017-2018    61
Houston Rockets      2018-2019    60
Cleveland Cavaliers  2017-2018    59
Miami Heat           2017-2018    57

In [6]:
nba.groupby('Position').agg({'Season':'max' , 'Date':'count'}).sort_values('Date', ascending = False)

             Season  Date
Position
G         2018-2019   184
SG        2018-2019   173
C         2018-2019   164
PF        2018-2019   142
F         2018-2019   137
PG        2018-2019   122
SF        2017-2018   119
FC        2018-2019    84
GF        2018-2019    50
F-C       2002-2003     9
G-F       2003-2004     3

In [7]:
## Data Source: https://data.world/datadavis/nba-salaries
salary = pd.read_excel('../data/NBA_Salary_1990-2017.xlsx')
salary = salary.drop(columns = 'Register Value')
salary.head()

  Player Name  Salary in $  Season Start  Season End Team      Full Team Name
0  A.C. Green      1750000          1990        1991  LAL  Los Angeles Lakers
1  A.C. Green      1750000          1991        1992  LAL  Los Angeles Lakers
2  A.C. Green      1750000          1992        1993  LAL  Los Angeles Lakers
3  A.C. Green      1885000          1993        1994  PHO        Phoenix Suns
4  A.C. Green      6472600          1994        1995  PHO        Phoenix Suns

In [8]:
salary.loc[(salary['Season Start'] == 2017) & (salary['Player Name'] == 'Stephen Curry')]

,Player Name,Salary in $,Season Start,Season End,Team,Full Team Name
10407,Stephen Curry,34682550,2017,2018,GSW,Golden State Warriors

In [9]:
salary201819 = pd.read_csv('../data/NBA_Salary_2018-2019.csv')
salary201819['Player Name'] = salary201819['Player'].str.split(pat = '\\', expand = True)[0]
salary201819['Salary in $'] = salary201819['2018-19'].str.slice(start = 1)
salary201819 = (salary201819[['Player Name', 'Tm', 'Salary in $']]
                .rename(columns = {'Tm': 'Team'}))
salary201819['Season Start'] = 2018
salary201819['Season End'] = 2019
salary201819 = pd.merge(salary201819, salary[['Team', 'Full Team Name']].drop_duplicates(), on = 'Team', how = 'left')

In [10]:
salary201819.head()

,Player Name,Team,Salary in $,Season Start,Season End,Full Team Name
0,Stephen Curry,GSW,37457154,2018,2019,Golden State Warriors
1,Chris Paul,HOU,35654150,2018,2019,Houston Rockets
2,Russell Westbrook,OKC,35654150,2018,2019,Oklahoma City Thunder
3,LeBron James,LAL,35654150,2018,2019,Los Angeles Lakers
4,Blake Griffin,DET,32088932,2018,2019,Detroit Pistons

In [11]:
salarydf = pd.concat([salary, salary201819], sort = True)

In [12]:
salarydf.head()

       Full Team Name Player Name Salary in $  Season End  Season Start Team
0  Los Angeles Lakers  A.C. Green     1750000        1991          1990  LAL
1  Los Angeles Lakers  A.C. Green     1750000        1992          1991  LAL
2  Los Angeles Lakers  A.C. Green     1750000        1993          1992  LAL
3        Phoenix Suns  A.C. Green     1885000        1994          1993  PHO
4        Phoenix Suns  A.C. Green     6472600        1995          1994  PHO

In [13]:
salarydf.shape[0]

12415

In [14]:
abb = pd.read_csv('../data/NBA_Teams_Abb.csv')
abb.head()

  Abbreviation/Acronym          Franchise
0                  ATL      Atlanta Hawks
1                  BKN      Brooklyn Nets
2                  BOS     Boston Celtics
3                  CHA  Charlotte Hornets
4                  CHI      Chicago Bulls

In [15]:
salarydf_clean = pd.merge(salarydf, abb, left_on = 'Full Team Name', right_on = 'Franchise', how = 'left')
salarydf_clean.head()

,Full Team Name,Player Name,Salary in $,Season End,Season Start,Team,Abbreviation/Acronym,Franchise
0,Los Angeles Lakers,A.C. Green,1750000,1991,1990,LAL,LAL,Los Angeles Lakers
1,Los Angeles Lakers,A.C. Green,1750000,1992,1991,LAL,LAL,Los Angeles Lakers
2,Los Angeles Lakers,A.C. Green,1750000,1993,1992,LAL,LAL,Los Angeles Lakers
3,Phoenix Suns,A.C. Green,1885000,1994,1993,PHO,PHX,Phoenix Suns
4,Phoenix Suns,A.C. Green,6472600,1995,1994,PHO,PHX,Phoenix Suns

In [16]:
salarydf_clean.loc[salarydf_clean['Team'] != salarydf_clean['Abbreviation/Acronym']]

,Full Team Name,Player Name,Salary in $,Season End,Season Start,Team,Abbreviation/Acronym,Franchise
3,Phoenix Suns,A.C. Green,1885000,1994,1993,PHO,PHX,Phoenix Suns
4,Phoenix Suns,A.C. Green,6472600,1995,1994,PHO,PHX,Phoenix Suns
5,Phoenix Suns,A.C. Green,6473000,1996,1995,PHO,PHX,Phoenix Suns
10,Cleveland Caveliers,A.J. Bramlett,118974,2000,1999,CLE,NaN,NaN
25,Phoenix Suns,A.J. Price,62552,2015,2014,PHO,PHX,Phoenix Suns
...,...,...,...,...,...,...,...,...
12400,NaN,Mitch Creek,838464,2019,2018,BRK,NaN,NaN
12401,Boston Celtic,Jeff Roberson,838464,2019,2018,BOS,NaN,NaN
12402,Boston Celtic,Nick King,838464,2019,2018,BOS,NaN,NaN
12413,NaN,Emeka Okafor,100000,2019,2018,NOP,NaN,NaN
12414,Boston Celtic,Demetrius Jackson,92857,2019,2018,BOS,NaN,NaN